MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18344/mcu.h
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x1CD1);	// @ (0x39A * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x1CD2);	// @ (0x39A * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x1CD7);	// @ (0x39A * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x4889);	// @ (0x911 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x4899);	// @ (0x913 * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,1)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x489A);	// @ (0x913 * 8 + 2)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,2)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x48D4);	// @ (0x91A * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x48D5);	// @ (0x91A * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x48D6);	// @ (0x91A * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x48DF);	// @ (0x91B * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE3<CSWIE>
extern volatile __bit                   CSWIE               __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<CSWIF>
extern volatile __bit                   CSWIF               __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR3,6)
// CWG1CLKCON<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLKCON,0)
// CWG1DAT<CWG1DAT0>
extern volatile __bit                   CWG1DAT0            __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 CWG1DAT0_bit        _BIT_ACCESS(CWG1DAT,0)
// CWG1DAT<CWG1DAT1>
extern volatile __bit                   CWG1DAT1            __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 CWG1DAT1_bit        _BIT_ACCESS(CWG1DAT,1)
// CWG1DAT<CWG1DAT2>
extern volatile __bit                   CWG1DAT2            __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 CWG1DAT2_bit        _BIT_ACCESS(CWG1DAT,2)
// CWG1DAT<CWG1DAT3>
extern volatile __bit                   CWG1DAT3            __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 CWG1DAT3_bit        _BIT_ACCESS(CWG1DAT,3)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x34A4);	// @ (0x694 * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x34A5);	// @ (0x694 * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x3498);	// @ (0x693 * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE4<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR4,6)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x34B5);	// @ (0x696 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x34BC);	// @ (0x697 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x34BD);	// @ (0x697 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD3<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x48A6);	// @ (0x914 * 8 + 6)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD3,6)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x34CC);	// @ (0x699 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x34B3);	// @ (0x696 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1PPS<CWG1PPS0>
extern volatile __bit                   CWG1PPS0            __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 CWG1PPS0_bit        _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1PPS1>
extern volatile __bit                   CWG1PPS1            __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 CWG1PPS1_bit        _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1PPS2>
extern volatile __bit                   CWG1PPS2            __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 CWG1PPS2_bit        _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1PPS3>
extern volatile __bit                   CWG1PPS3            __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 CWG1PPS3_bit        _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1PPS4>
extern volatile __bit                   CWG1PPS4            __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 CWG1PPS4_bit        _BIT_ACCESS(CWG1PPS,4)
// CWG1AS0<CWG1REN>
extern volatile __bit                   CWG1REN             __at(0x34BE);	// @ (0x697 * 8 + 6)
#define                                 CWG1REN_bit         _BIT_ACCESS(CWG1AS0,6)
// CWG1AS0<CWG1SHUTDOWN>
extern volatile __bit                   CWG1SHUTDOWN        __at(0x34BF);	// @ (0x697 * 8 + 7)
#define                                 CWG1SHUTDOWN_bit    _BIT_ACCESS(CWG1AS0,7)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG2CLKCON<CWG2CS>
extern volatile __bit                   CWG2CS              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 CWG2CS_bit          _BIT_ACCESS(CWG2CLKCON,0)
// CWG2DAT<CWG2DAT0>
extern volatile __bit                   CWG2DAT0            __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 CWG2DAT0_bit        _BIT_ACCESS(CWG2DAT,0)
// CWG2DAT<CWG2DAT1>
extern volatile __bit                   CWG2DAT1            __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 CWG2DAT1_bit        _BIT_ACCESS(CWG2DAT,1)
// CWG2DAT<CWG2DAT2>
extern volatile __bit                   CWG2DAT2            __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 CWG2DAT2_bit        _BIT_ACCESS(CWG2DAT,2)
// CWG2DAT<CWG2DAT3>
extern volatile __bit                   CWG2DAT3            __at(0x3893);	// @ (0x712 * 8 + 3)
#define                                 CWG2DAT3_bit        _BIT_ACCESS(CWG2DAT,3)
// CWG2DBF<CWG2DBF0>
extern volatile __bit                   CWG2DBF0            __at(0x38A0);	// @ (0x714 * 8 + 0)
#define                                 CWG2DBF0_bit        _BIT_ACCESS(CWG2DBF,0)
// CWG2DBF<CWG2DBF1>
extern volatile __bit                   CWG2DBF1            __at(0x38A1);	// @ (0x714 * 8 + 1)
#define                                 CWG2DBF1_bit        _BIT_ACCESS(CWG2DBF,1)
// CWG2DBF<CWG2DBF2>
extern volatile __bit                   CWG2DBF2            __at(0x38A2);	// @ (0x714 * 8 + 2)
#define                                 CWG2DBF2_bit        _BIT_ACCESS(CWG2DBF,2)
// CWG2DBF<CWG2DBF3>
extern volatile __bit                   CWG2DBF3            __at(0x38A3);	// @ (0x714 * 8 + 3)
#define                                 CWG2DBF3_bit        _BIT_ACCESS(CWG2DBF,3)
// CWG2DBF<CWG2DBF4>
extern volatile __bit                   CWG2DBF4            __at(0x38A4);	// @ (0x714 * 8 + 4)
#define                                 CWG2DBF4_bit        _BIT_ACCESS(CWG2DBF,4)
// CWG2DBF<CWG2DBF5>
extern volatile __bit                   CWG2DBF5            __at(0x38A5);	// @ (0x714 * 8 + 5)
#define                                 CWG2DBF5_bit        _BIT_ACCESS(CWG2DBF,5)
// CWG2DBR<CWG2DBR0>
extern volatile __bit                   CWG2DBR0            __at(0x3898);	// @ (0x713 * 8 + 0)
#define                                 CWG2DBR0_bit        _BIT_ACCESS(CWG2DBR,0)
// CWG2DBR<CWG2DBR1>
extern volatile __bit                   CWG2DBR1            __at(0x3899);	// @ (0x713 * 8 + 1)
#define                                 CWG2DBR1_bit        _BIT_ACCESS(CWG2DBR,1)
// CWG2DBR<CWG2DBR2>
extern volatile __bit                   CWG2DBR2            __at(0x389A);	// @ (0x713 * 8 + 2)
#define                                 CWG2DBR2_bit        _BIT_ACCESS(CWG2DBR,2)
// CWG2DBR<CWG2DBR3>
extern volatile __bit                   CWG2DBR3            __at(0x389B);	// @ (0x713 * 8 + 3)
#define                                 CWG2DBR3_bit        _BIT_ACCESS(CWG2DBR,3)
// CWG2DBR<CWG2DBR4>
extern volatile __bit                   CWG2DBR4            __at(0x389C);	// @ (0x713 * 8 + 4)
#define                                 CWG2DBR4_bit        _BIT_ACCESS(CWG2DBR,4)
// CWG2DBR<CWG2DBR5>
extern volatile __bit                   CWG2DBR5            __at(0x389D);	// @ (0x713 * 8 + 5)
#define                                 CWG2DBR5_bit        _BIT_ACCESS(CWG2DBR,5)
// CWG2CON0<CWG2EN>
extern volatile __bit                   CWG2EN              __at(0x38AF);	// @ (0x715 * 8 + 7)
#define                                 CWG2EN_bit          _BIT_ACCESS(CWG2CON0,7)
// PIE4<CWG2IE>
extern volatile __bit                   CWG2IE              __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 CWG2IE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<CWG2IF>
extern volatile __bit                   CWG2IF              __at(0xA7);	// @ (0x14 * 8 + 7)
#define                                 CWG2IF_bit          _BIT_ACCESS(PIR4,7)
// CWG2CON1<CWG2IN>
extern volatile __bit                   CWG2IN              __at(0x38B5);	// @ (0x716 * 8 + 5)
#define                                 CWG2IN_bit          _BIT_ACCESS(CWG2CON1,5)
// CWG2CON0<CWG2LD>
extern volatile __bit                   CWG2LD              __at(0x38AE);	// @ (0x715 * 8 + 6)
#define                                 CWG2LD_bit          _BIT_ACCESS(CWG2CON0,6)
// CWG2AS0<CWG2LSAC0>
extern volatile __bit                   CWG2LSAC0           __at(0x38BA);	// @ (0x717 * 8 + 2)
#define                                 CWG2LSAC0_bit       _BIT_ACCESS(CWG2AS0,2)
// CWG2AS0<CWG2LSAC1>
extern volatile __bit                   CWG2LSAC1           __at(0x38BB);	// @ (0x717 * 8 + 3)
#define                                 CWG2LSAC1_bit       _BIT_ACCESS(CWG2AS0,3)
// CWG2AS0<CWG2LSBD0>
extern volatile __bit                   CWG2LSBD0           __at(0x38BC);	// @ (0x717 * 8 + 4)
#define                                 CWG2LSBD0_bit       _BIT_ACCESS(CWG2AS0,4)
// CWG2AS0<CWG2LSBD1>
extern volatile __bit                   CWG2LSBD1           __at(0x38BD);	// @ (0x717 * 8 + 5)
#define                                 CWG2LSBD1_bit       _BIT_ACCESS(CWG2AS0,5)
// PMD3<CWG2MD>
extern volatile __bit                   CWG2MD              __at(0x48A7);	// @ (0x914 * 8 + 7)
#define                                 CWG2MD_bit          _BIT_ACCESS(PMD3,7)
// CWG2CON0<CWG2MODE0>
extern volatile __bit                   CWG2MODE0           __at(0x38A8);	// @ (0x715 * 8 + 0)
#define                                 CWG2MODE0_bit       _BIT_ACCESS(CWG2CON0,0)
// CWG2CON0<CWG2MODE1>
extern volatile __bit                   CWG2MODE1           __at(0x38A9);	// @ (0x715 * 8 + 1)
#define                                 CWG2MODE1_bit       _BIT_ACCESS(CWG2CON0,1)
// CWG2CON0<CWG2MODE2>
extern volatile __bit                   CWG2MODE2           __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 CWG2MODE2_bit       _BIT_ACCESS(CWG2CON0,2)
// CWG2STR<CWG2OVRA>
extern volatile __bit                   CWG2OVRA            __at(0x38CC);	// @ (0x719 * 8 + 4)
#define                                 CWG2OVRA_bit        _BIT_ACCESS(CWG2STR,4)
// CWG2STR<CWG2OVRB>
extern volatile __bit                   CWG2OVRB            __at(0x38CD);	// @ (0x719 * 8 + 5)
#define                                 CWG2OVRB_bit        _BIT_ACCESS(CWG2STR,5)
// CWG2STR<CWG2OVRC>
extern volatile __bit                   CWG2OVRC            __at(0x38CE);	// @ (0x719 * 8 + 6)
#define                                 CWG2OVRC_bit        _BIT_ACCESS(CWG2STR,6)
// CWG2STR<CWG2OVRD>
extern volatile __bit                   CWG2OVRD            __at(0x38CF);	// @ (0x719 * 8 + 7)
#define                                 CWG2OVRD_bit        _BIT_ACCESS(CWG2STR,7)
// CWG2CON1<CWG2POLA>
extern volatile __bit                   CWG2POLA            __at(0x38B0);	// @ (0x716 * 8 + 0)
#define                                 CWG2POLA_bit        _BIT_ACCESS(CWG2CON1,0)
// CWG2CON1<CWG2POLB>
extern volatile __bit                   CWG2POLB            __at(0x38B1);	// @ (0x716 * 8 + 1)
#define                                 CWG2POLB_bit        _BIT_ACCESS(CWG2CON1,1)
// CWG2CON1<CWG2POLC>
extern volatile __bit                   CWG2POLC            __at(0x38B2);	// @ (0x716 * 8 + 2)
#define                                 CWG2POLC_bit        _BIT_ACCESS(CWG2CON1,2)
// CWG2CON1<CWG2POLD>
extern volatile __bit                   CWG2POLD            __at(0x38B3);	// @ (0x716 * 8 + 3)
#define                                 CWG2POLD_bit        _BIT_ACCESS(CWG2CON1,3)
// CWG2PPS<CWG2PPS0>
extern volatile __bit                   CWG2PPS0            __at(0x70C8);	// @ (0xE19 * 8 + 0)
#define                                 CWG2PPS0_bit        _BIT_ACCESS(CWG2PPS,0)
// CWG2PPS<CWG2PPS1>
extern volatile __bit                   CWG2PPS1            __at(0x70C9);	// @ (0xE19 * 8 + 1)
#define                                 CWG2PPS1_bit        _BIT_ACCESS(CWG2PPS,1)
// CWG2PPS<CWG2PPS2>
extern volatile __bit                   CWG2PPS2            __at(0x70CA);	// @ (0xE19 * 8 + 2)
#define                                 CWG2PPS2_bit        _BIT_ACCESS(CWG2PPS,2)
// CWG2PPS<CWG2PPS3>
extern volatile __bit                   CWG2PPS3            __at(0x70CB);	// @ (0xE19 * 8 + 3)
#define                                 CWG2PPS3_bit        _BIT_ACCESS(CWG2PPS,3)
// CWG2PPS<CWG2PPS4>
extern volatile __bit                   CWG2PPS4            __at(0x70CC);	// @ (0xE19 * 8 + 4)
#define                                 CWG2PPS4_bit        _BIT_ACCESS(CWG2PPS,4)
// CWG2AS0<CWG2REN>
extern volatile __bit                   CWG2REN             __at(0x38BE);	// @ (0x717 * 8 + 6)
#define                                 CWG2REN_bit         _BIT_ACCESS(CWG2AS0,6)
// CWG2AS0<CWG2SHUTDOWN>
extern volatile __bit                   CWG2SHUTDOWN        __at(0x38BF);	// @ (0x717 * 8 + 7)
#define                                 CWG2SHUTDOWN_bit    _BIT_ACCESS(CWG2AS0,7)
// CWG2STR<CWG2STRA>
extern volatile __bit                   CWG2STRA            __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 CWG2STRA_bit        _BIT_ACCESS(CWG2STR,0)
// CWG2STR<CWG2STRB>
extern volatile __bit                   CWG2STRB            __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 CWG2STRB_bit        _BIT_ACCESS(CWG2STR,1)
// CWG2STR<CWG2STRC>
extern volatile __bit                   CWG2STRC            __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 CWG2STRC_bit        _BIT_ACCESS(CWG2STR,2)
// CWG2STR<CWG2STRD>
extern volatile __bit                   CWG2STRD            __at(0x38CB);	// @ (0x719 * 8 + 3)
#define                                 CWG2STRD_bit        _BIT_ACCESS(CWG2STR,3)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DACCON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DACCON0,7)
// DACCON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DACCON0,0)
// DACCON0<DAC1OE>
extern volatile __bit                   DAC1OE              __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 DAC1OE_bit          _BIT_ACCESS(DACCON0,5)
// DACCON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DACCON0,2)
// DACCON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DACCON0,3)
// DACCON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DACCON1,0)
// DACCON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DACCON1,1)
// DACCON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x8CA);	// @ (0x119 * 8 + 2)
